---
kind: property
id: P:Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves.Distance
source: html/7a02d28e-7ac7-93bf-36b7-9f1d1375d339.htm
---
# Autodesk.Revit.DB.ClosestPointsPairBetweenTwoCurves.Distance Property

Distance from point on first curve to the point on second curve.

## Syntax (C#)
```csharp
public double Distance { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The property has not been set by the method providing the result.